PushDebugMessage("#eDC4C18#cFFFF00 #81自动销毁100级以上的白绿准备,在脚本结束前，不允许整理背包，不然会误销毁！！！！！");
-- 此方法用来强制销毁系统送的装备，如果有需要直接捡销毁的装备，可以直接在这下面的数组里面添加。请保持格式一致
local DropCommonItem = {
"冰凝风寒帽","冰凝风寒护手","冰凝风寒鞋","冰凝风寒指环","冰凝风寒护符",
"毒影瘴华帽","毒影瘴华护手","毒影瘴华鞋","毒影瘴华指环","毒影瘴华护符",
"火炽焚焰帽","火炽焚焰护手","火炽焚焰鞋","火炽焚焰指环","火炽焚焰护符",
"玄光雷煞帽","玄光雷煞护手","玄光雷煞鞋","玄光雷煞指环","玄光雷煞护符",
"修碧手环","修碧腰丝","修碧之愿","修碧之缠","心瀚护膀","心瀚之风","心瀚之涟","心瀚之尘","菩提","菩提月闵盔","菩提月流鞋","菩提月影手","菩提月梦甲",
"雪月拈花腕","雪月拈花带","雪月之兰","雪月之环","枯心莞玉臂","枯心之月","枯心之瑞","枯心之慈","苍玉","苍玉龙麟首","苍玉龙麟脚","苍玉龙麟爪","苍玉龙麟之灵",
"素女化雨肩","素女腰带","素女之月","素女之源","斩情之魅","斩情玄魅护腕","斩情之魄","斩情之冥","神噬","神噬玉落冠","神噬玉落鞋","神噬玉落手","神噬玉落法袍",
"寒雾漫影腕","寒雾腰环","寒雾之涌","寒雾之泣","水曜之星","水曜探归肩","水曜之峰","水曜之环","玄机","玄机冥天冠","玄机冥天鞋","玄机冥天手","玄机冥袍",
"无涯八荒肩","无涯腰环","无涯之穹","无涯之苍","秋水青云腕","秋水之怜","秋水之环","秋水之朽","行云","行云逐月首","行云逐月鞋","行云逐月手","行云逐月之生灵",
"碎魂月塑腕","碎魂束腰","碎魂之梦","碎魂之细语","迟悔芸玲护肩","迟悔之沐","迟悔之环","迟悔之懵","碧落","碧落泻银首","碧落泻银鞋","碧落泻银手","碧落泻银的诱惑",
"炎日熔火肩","炎日熔火之环","炎日之韵","炎日之灵","冷月之铸","冷月玉魅护腕","冷月之环","冷月之岚","九阳","九阳碧麟盔","九阳碧麟鞋","九阳碧麟手","九阳碧麟甲",
"屠龙文铁腕","屠龙腰带","屠龙之火","屠龙之水","斩龙之影","斩龙塑铁肩","斩龙之荒","斩龙之默","鲲鹏","鲲鹏哀伤之盔","鲲鹏哀伤之鞋","鲲鹏哀伤之手","鲲鹏哀伤之甲",
"三笑银桑腕","三笑腰带","三笑之哀","三笑之月","残魂之雪","残魂蛟梦肩","残魂之眸","残魂之曜","流魂","流魂宿灭冠","流魂宿灭鞋","流魂宿灭手","流魂宿灭法袍",
"怒缨之链","怒缨戒指","怒缨之护","怒缨护肩","锐锋","锐锋将冠","锐锋将铠","锐锋手套","锐锋将靴","血刃腰带","血刃戒指","血刃护符","血刃护腕",
"朔光","朔光六合冠","朔光六合靴","朔光六合手","朔光六合铠","天工千机腕","锐锋将铠","锐锋手套","锐锋将靴","血刃腰带","血刃戒指","血刃护符","血刃护腕",
"紫微玄光","紫微玄光冠","紫微玄光靴","紫微玄光手","紫微玄光铠","北冥摇光符","锐锋将铠","锐锋手套","锐锋将靴","血刃腰带","血刃戒指","血刃护符","血刃护腕",
"玄卢枪","玄铁剑","鸳鸯刀","风雨扇","龙凤环","水月弩","水月杖","百炼","百战","长乐","未央","湛卢","龙渊","劈风","苍龙","卧龙","凤雏","太皇","斩关","四象虎骨弩","灵宝弩","四象梨花杖","灵冥杖","金纂穿云",
"圣火之铩羽","降龙之铩羽","达摩之天崩","圣火之天崩","降龙之天崩","玉女之混沌","无极之混沌","荒毒之混沌","玉女之莫问","无极之莫问","荒毒之莫问","无相之末路","北冥之末路","凝脉之末路","无相之黄泉","北冥之黄泉","凝脉之黄泉","万羽之绝生","纵横之玉霄","达摩之蛰龙天盔","圣火之蛰龙天盔","降龙之蛰龙天盔","玉女之灵动天冠","无极之灵动天冠","荒毒之灵动天冠","无相之狻猊帽","北冥之狻猊帽","凝脉之狻猊帽","达摩之蛰龙圣靴","圣火之蛰龙圣靴","降龙之蛰龙圣靴","玉女之灵动天靴","无极之灵动天靴","荒毒之灵动天靴","无相之狻猊圣履","北冥之狻猊圣履","凝脉之狻猊圣履","达摩之蛰龙手甲","圣火之蛰龙手甲","降龙之蛰龙手甲","玉女之灵动手套","无极之灵动手套","荒毒之灵动手套","无相之狻猊护手","北冥之狻猊护手","凝脉之狻猊护手","达摩之蛰龙天铠","圣火之蛰龙天铠","降龙之蛰龙天铠","玉女之灵动天衣","无极之灵动天衣","荒毒之灵动天衣","无相之狻猊天裘","北冥之狻猊天裘","凝脉之狻猊天裘","达摩之蛰龙圣腕","圣火之蛰龙圣腕","降龙之蛰龙圣腕","玉女之灵动圣腕","无极之灵动圣腕","荒毒之灵动圣腕","无相之狻猊魔腕","北冥之狻猊魔腕","凝脉之狻猊魔腕","达摩之蛰龙圣肩","圣火之蛰龙圣肩","降龙之蛰龙圣肩","玉女之灵动圣肩","无极之灵动圣肩","荒毒之灵动圣肩","无相之狻猊圣肩","北冥之狻猊圣肩","凝脉之狻猊圣肩",
"乌玛斧","云鹿迅弩","倾云朗月弩","飞花杖","碧海青云杖","嵌金铭头锤","驰马","藏因长刃","敖汉","双瞳","鹿鸣枪","月白","塔哈","石谷","启明","寒姜","怒哈","雅辛","君天","古兰","沙丘","象血","珊瑚扇","忘川扇","夏弗环","锡兰","四叶轨","锦瑟璧","盘龙象牙弩","丹阳凤梧弩","震天弩","落日弩","楼兰八宝杖","凤阳灵梧杖","妙天杖","神霄杖","莫愁帽","蜃楼帽","无道冠","皎月巾","开源帽","孔羽冠","漫沙冠","昆仑巾","落火帽","匈奴冠","古营冠","先知冠","莫愁鞋","蜃楼鞋","逍遥靴","开明靴","开源靴","孔羽靴","塔钟鞋","清修鞋","落火靴","匈奴战靴","翼牛鞋","七龙靴","莫愁护手","蜃楼护手","婵娟护手","虔心护手","开源护手","孔羽护手","苦泉护手","戒律手","落火护手","匈奴护手","血影手","轩辕手","莫愁衣","蜃楼袍","狮王锦袍","高昌袍","开源裘","孔羽裘","沼泽裘","生机裘","落火铠","匈奴铠","重华铠","烽燧铠","兰沁护腕","如故护腕","侍佛","归宿","纳林护肩","圣灵肩","白石肩","日月肩","寂夜","七眠链","曼殊沙华","泣露链","血玉带","仙武带","示骨带","谪仙带","安息指环","曼陀戒指","彼岸","吉祥夜","琉晶","婆娑纹章","乌德护符","鹰翔纹章","寂灭佛戒","焚仙之星","啸天护戒","诛魔玄戒","碧神指环 ","骨灵法魂","天隐指环","仙逸法戒","乌日指环","斗转异互戒","羲和神玄戒","斗姆星威戒","寂灭护符","焚仙之辰","啸天法符","诛魔玄符","碧神护符","骨灵残魄","天隐护符","仙逸法符","乌日护符","斗转异互符","羲和神玄符","斗姆星威符"
}

local num = {}

function findItem(item)
	num = {};
	for i=0,30 do
		local nId = GetLuaValue("local theAction = EnumAction("..i-1 ..", 'packageitem');return theAction:GetID();","n",1)
		if nId~=0 then
			local sName = GetLuaValue("local theAction = EnumAction("..i-1 ..", 'packageitem');return theAction:GetName();","s",1)
			if sName==item then
				for a=0,i-1 do
					num[a] = i-1;
				end
			end
		end
	end
	
	for key,value in ipairs(num) do
		PushDebugMessage("销毁装备名称： [" .. item.."]");
		-- 等待(50)
		CallFun(5,value);
		break;return true;
	end
end

function doDelete()


	
end

function doFindItem()

	for key,value in ipairs(DropCommonItem) 
	do
		-- PushDebugMessage(value.."-------"..key);
		-- 等待(50)
		findItem(value);
	end
	
end


for	i = 1,10 do
	doFindItem();
end
PushDebugMessage("#eDC4C18#cFFFF00销毁装备完成#1");
