--[[
小男人老板号接收交易物品
--]]
local items = " 龙纹玉灵 棉布碎片 秘银碎片 高级药材 珍兽蛋 中级药材 缀龙石·元 缀龙石·伤 缀龙石·暴 技能书 玉龙髓 净云水 铸纹血玉 玉华灵泉 释灵浆 ";
local players = {
	"°凌筱雨．≈","″．波少ヽ","﹎素颜．や","′雪走","丶漫步ゾ天龙","平凡の",
	"Se⒎蕝蝂哥℡","′梦影．や"," ﹏岚ゝ兮°","超级↑→奶妈","╰☆TeaR陌ゝ","Am°惜你若命",
	"ぁ壹葉醬油あ","﹏菲儿、ゝ","雨林之后","红颜傲﹡．","しF笑天Dす","此生的回矇",
	"暒涳芐哋埖焱","°﹎紫龍ヤ","天子月","TH－莫囄","ら﹏笨呆呆°","小小书童2",
	"逗逗．や","豆豆妈咪","情定三世丶","梵魚ˇ","灬枫ヽ昕℃","″踮脚拥他ゝ",
	"小叶丶绝杀","艳歌羅敷行","轻狂∴小可","霂鑰．ゞ","﹏紫．骄傲ゝ","．Lynthia",
	"﹎仙乐°","ˊ疾风剑豪ゝ","＂蔓蔓轻歌ゝ","′慕清枫．や","″う流漓","╰ˋ凉皮．﹡"
};

function main()
	-- 第一步,先销毁背包里面的宝宝肉
	LoadScript("[功]销指定物品")
	-- 第二步，先取出天机锦囊里面的所有需要取出的物品
	LoadScript("锦囊取物")
	-- 第三步，将取出来的物品存仓一次
	LoadScript("[功能] 物品存仓")
	-- 第四步，将取出来的物品存仓一次
	LoadScript("加工材料")
	local g_szItemName = AI_GetParameter("仓库取物")
	--参数1：需取出的物品名称 ，空格分开
	--参数2：取出的数量
	--参数3：需取出的绑定状态 0无所谓 1不绑的 2绑定的 可空
	--参数4：整理背包 true 或 false 可空
	--参数5：需取出的锁定状态 0无所谓 1不绑的 2绑定的 可空
	local nCnt = Bank_GetItem(items, 31, 1, true)
	for i = 1 , 4 do
		LoadScript("交易给老板号");Sleep(100);
	end
end
-- 执行主控
main()
-- 完成之后执行买卖补给
MoveToNPC(343,246,1,"梁伙计");Sleep(1000)