--[[
	脚本作用：全局常量脚本
	author:yulinzhihou
	email:yulinzhihou@gmail.com
	github:https://github.com/yulinzhihou
	Date:2020-07-21
]]

-----------------------------------------------------------
-- 所有队伍队伍信息
-----------------------------------------------------------
local allPlayers = {
	"烟雨任飘遥","青花瓷┿","ら。辞旧阙っ","狂的土豆","果然?W多","稚女",
	"、飞龙在天〃","·ˊ﹏沧澜ゝ","≠顺莳针","山城‖佰哥","电老大煤老虎","遠方",
	"緑·妖姬","．洛訫痕ゞ","ぺ灬绒绒ccル","金翅翎羽","°椿兮如梦つ","Marsゞ沧桑",
	"笨笨．ぃ","苦酒醉余生．","追梦丶少年","无名丶丶丶","身背两杆槍","游走云中",
	"Sandm幻影","ゆ陌丶笑秋ゝ","″忆了流年ら","．貂蝉ゝ","唯我毒尊","沐小帅。",
	"如风！","我爱丝丝"
};

-----------------------------------------------------------
-- 所有队伍队伍信息
-----------------------------------------------------------
local allPlayersStr = 
	"烟雨任飘遥","青花瓷┿","ら。辞旧阙っ","狂的土豆","果然?W多","稚女",
	"、飞龙在天〃","·ˊ﹏沧澜ゝ","≠顺莳针","山城‖佰哥","电老大煤老虎","遠方",
	"緑·妖姬","．洛訫痕ゞ","ぺ灬绒绒ccル","金翅翎羽","°椿兮如梦つ","Marsゞ沧桑",
	"笨笨．ぃ","苦酒醉余生．","追梦丶少年","无名丶丶丶","身背两杆槍","游走云中",
	"Sandm幻影","ゆ陌丶笑秋ゝ","″忆了流年ら","．貂蝉ゝ","唯我毒尊","沐小帅。",
	"如风！","我爱丝丝";

-----------------------------------------------------------
-- 需要聚宝盆的角色
-----------------------------------------------------------
local cornucopiaPlayers = {
	"烟雨任飘遥","青花瓷┿","ら。辞旧阙っ","狂的土豆","果然?W多","稚女",
	"、飞龙在天〃","·ˊ﹏沧澜ゝ","≠顺莳针","山城‖佰哥","电老大煤老虎","遠方",
	"緑·妖姬","．洛訫痕ゞ","ぺ灬绒绒ccル","金翅翎羽","°椿兮如梦つ","Marsゞ沧桑",
	"笨笨．ぃ","苦酒醉余生．","追梦丶少年","无名丶丶丶","身背两杆槍","游走云中",
	"Sandm幻影","ゆ陌丶笑秋ゝ","″忆了流年ら","．貂蝉ゝ","唯我毒尊","沐小帅。",
	"如风！","我爱丝丝"
};


-----------------------------------------------------------
-- 12人副本主队
-----------------------------------------------------------
local masterPlayers = {
	"烟雨任飘遥","青花瓷┿","ら。辞旧阙っ","狂的土豆","果然?W多","稚女",
	"、飞龙在天〃","·ˊ﹏沧澜ゝ","≠顺莳针","山城‖佰哥","电老大煤老虎","遠方",
	"緑·妖姬","．洛訫痕ゞ","ぺ灬绒绒ccル","金翅翎羽","°椿兮如梦つ","Marsゞ沧桑",
	"笨笨．ぃ","苦酒醉余生．","追梦丶少年","无名丶丶丶","身背两杆槍","游走云中",
	"Sandm幻影","ゆ陌丶笑秋ゝ","″忆了流年ら","．貂蝉ゝ","唯我毒尊","沐小帅。",
	"如风！","我爱丝丝",
};


-----------------------------------------------------------
-- 12人副本副队
-----------------------------------------------------------
local slavePlayers = {
	"烟雨任飘遥","青花瓷┿","ら。辞旧阙っ","狂的土豆","果然?W多","稚女",
	"、飞龙在天〃","·ˊ﹏沧澜ゝ","≠顺莳针","山城‖佰哥","电老大煤老虎","遠方",
	"緑·妖姬","．洛訫痕ゞ","ぺ灬绒绒ccル","金翅翎羽","°椿兮如梦つ","Marsゞ沧桑",
	"笨笨．ぃ","苦酒醉余生．","追梦丶少年","无名丶丶丶","身背两杆槍","游走云中",
	"Sandm幻影","ゆ陌丶笑秋ゝ","″忆了流年ら","．貂蝉ゝ","唯我毒尊","沐小帅。",
	"如风！","我爱丝丝",
};

-----------------------------------------------------------
-- 商会管理与合作伙伴
-----------------------------------------------------------
local cooperativePartnerPlayers= {
	"烟雨任飘遥","青花瓷┿","ら。辞旧阙っ","狂的土豆","果然?W多","稚女",
	"、飞龙在天〃","·ˊ﹏沧澜ゝ","≠顺莳针","山城‖佰哥","电老大煤老虎","遠方",
	"緑·妖姬","．洛訫痕ゞ","ぺ灬绒绒ccル","金翅翎羽","°椿兮如梦つ","Marsゞ沧桑",
	"笨笨．ぃ","苦酒醉余生．","追梦丶少年","无名丶丶丶","身背两杆槍","游走云中",
	"Sandm幻影","ゆ陌丶笑秋ゝ","″忆了流年ら","．貂蝉ゝ","唯我毒尊","沐小帅。",
	"如风！","我爱丝丝",
};


-----------------------------------------------------------
-- 所有的队长号
-----------------------------------------------------------
local leaderPlayers = {
	"烟雨任飘遥","青花瓷┿","ら。辞旧阙っ","狂的土豆","果然?W多","稚女",
	"、飞龙在天〃","·ˊ﹏沧澜ゝ","≠顺莳针","山城‖佰哥","电老大煤老虎","遠方",
	"緑·妖姬","．洛訫痕ゞ","ぺ灬绒绒ccル","金翅翎羽","°椿兮如梦つ","Marsゞ沧桑",
	"笨笨．ぃ","苦酒醉余生．","追梦丶少年","无名丶丶丶","身背两杆槍","游走云中",
	"Sandm幻影","ゆ陌丶笑秋ゝ","″忆了流年ら","．貂蝉ゝ","唯我毒尊","沐小帅。",
	"如风！","我爱丝丝",
}


-----------------------------------------------------------
-- 8星神器任务需要做的人员
-----------------------------------------------------------
local eightStarsWeaponPlayers = {
	"烟雨任飘遥","青花瓷┿","ら。辞旧阙っ","狂的土豆","果然?W多","稚女",
	"、飞龙在天〃","·ˊ﹏沧澜ゝ","≠顺莳针","山城‖佰哥","电老大煤老虎","遠方",
	"緑·妖姬","．洛訫痕ゞ","ぺ灬绒绒ccル","金翅翎羽","°椿兮如梦つ","Marsゞ沧桑",
	"笨笨．ぃ","苦酒醉余生．","追梦丶少年","无名丶丶丶","身背两杆槍","游走云中",
	"Sandm幻影","ゆ陌丶笑秋ゝ","″忆了流年ら","．貂蝉ゝ","唯我毒尊","沐小帅。",
	"如风！","我爱丝丝",
}


-----------------------------------------------------------
-- 和尚队伍
-----------------------------------------------------------
local monkPlayers = {
	"烟雨任飘遥","青花瓷┿","ら。辞旧阙っ","狂的土豆","果然?W多","稚女",
	"、飞龙在天〃","·ˊ﹏沧澜ゝ","≠顺莳针","山城‖佰哥","电老大煤老虎","遠方",
	"緑·妖姬","．洛訫痕ゞ","ぺ灬绒绒ccル","金翅翎羽","°椿兮如梦つ","Marsゞ沧桑",
	"笨笨．ぃ","苦酒醉余生．","追梦丶少年","无名丶丶丶","身背两杆槍","游走云中",
	"Sandm幻影","ゆ陌丶笑秋ゝ","″忆了流年ら","．貂蝉ゝ","唯我毒尊","沐小帅。",
	"如风！","我爱丝丝",
}


-----------------------------------------------------------
-- 刷猪队伍
-----------------------------------------------------------
local pigPlayers = {
	"烟雨任飘遥","青花瓷┿","ら。辞旧阙っ","狂的土豆","果然?W多","稚女",
	"、飞龙在天〃","·ˊ﹏沧澜ゝ","≠顺莳针","山城‖佰哥","电老大煤老虎","遠方",
	"緑·妖姬","．洛訫痕ゞ","ぺ灬绒绒ccル","金翅翎羽","°椿兮如梦つ","Marsゞ沧桑",
	"笨笨．ぃ","苦酒醉余生．","追梦丶少年","无名丶丶丶","身背两杆槍","游走云中",
	"Sandm幻影","ゆ陌丶笑秋ゝ","″忆了流年ら","．貂蝉ゝ","唯我毒尊","沐小帅。",
	"如风！","我爱丝丝",
}